# Data Cleaning and Preparation

### Handling Missing Data

In [1]:
import pandas as pd
import numpy as np

In [3]:
string_data=pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0]=None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering Out Missing Data

In [6]:
data=pd.Series([1, np.nan, 3.5, np.nan, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
data=pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan], [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
cleaned=data.dropna() #With DataFrame, dropna by default drops any row containing missing value
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [8]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [9]:
#Passing how='all' will only drop rows that are all NA
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [10]:
#To drop columns in the same way, pass axis=1
data[4]=np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [11]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [12]:
df=pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1]=np.nan
df.iloc[:2, 2]=np.nan
df

          0         1         2
0  1.173101       NaN       NaN
1 -0.510466       NaN       NaN
2  0.341136       NaN -0.149229
3 -0.884030       NaN  0.178326
4 -0.544996  0.311183 -0.573347
5  1.466259 -1.299127  1.131409
6 -0.998301  1.011051 -0.043891

In [13]:
df.dropna()

          0         1         2
4 -0.544996  0.311183 -0.573347
5  1.466259 -1.299127  1.131409
6 -0.998301  1.011051 -0.043891

In [14]:
df.dropna(thresh=2)

          0         1         2
2  0.341136       NaN -0.149229
3 -0.884030       NaN  0.178326
4 -0.544996  0.311183 -0.573347
5  1.466259 -1.299127  1.131409
6 -0.998301  1.011051 -0.043891

### Filling in Missing Data

In [15]:
df.fillna(0)

          0         1         2
0  1.173101  0.000000  0.000000
1 -0.510466  0.000000  0.000000
2  0.341136  0.000000 -0.149229
3 -0.884030  0.000000  0.178326
4 -0.544996  0.311183 -0.573347
5  1.466259 -1.299127  1.131409
6 -0.998301  1.011051 -0.043891

In [16]:
#Calling fillna with a dict, you cna use a different fill value for each column
df.fillna({1:0.5, 2:0}) #returns a new object

          0         1         2
0  1.173101  0.500000  0.000000
1 -0.510466  0.500000  0.000000
2  0.341136  0.500000 -0.149229
3 -0.884030  0.500000  0.178326
4 -0.544996  0.311183 -0.573347
5  1.466259 -1.299127  1.131409
6 -0.998301  1.011051 -0.043891

In [17]:
_=df.fillna(0, inplace=True)
df

          0         1         2
0  1.173101  0.000000  0.000000
1 -0.510466  0.000000  0.000000
2  0.341136  0.000000 -0.149229
3 -0.884030  0.000000  0.178326
4 -0.544996  0.311183 -0.573347
5  1.466259 -1.299127  1.131409
6 -0.998301  1.011051 -0.043891

In [18]:
df=pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1]=np.nan
df.iloc[4:, 2]=np.nan
df

          0         1         2
0  0.297798 -0.383334 -0.090033
1 -1.294111 -0.364541 -0.660421
2  0.122885       NaN -0.373036
3  0.420451       NaN  0.871282
4 -1.234645       NaN       NaN
5  2.151842       NaN       NaN

In [19]:
df.fillna(method='ffill')

          0         1         2
0  0.297798 -0.383334 -0.090033
1 -1.294111 -0.364541 -0.660421
2  0.122885 -0.364541 -0.373036
3  0.420451 -0.364541  0.871282
4 -1.234645 -0.364541  0.871282
5  2.151842 -0.364541  0.871282

In [20]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.297798 -0.383334 -0.090033
1 -1.294111 -0.364541 -0.660421
2  0.122885 -0.364541 -0.373036
3  0.420451 -0.364541  0.871282
4 -1.234645       NaN  0.871282
5  2.151842       NaN  0.871282

In [21]:
#pass the mea value of a Series
data=pd.Series([1., np.nan, 3.5, np.nan, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

### Removing Duplicates

In [22]:
data=pd.DataFrame({'k1':['one', 'two']*3+['two'], 'k2':[1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [23]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [24]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [25]:
data['v1']=range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [26]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data using a Function or Mapping

In [27]:
data=pd.DataFrame({'food':['bacon', 'pulled pork', 'bacon', 'pastrami', 'corned beef', 'Bacon',
                          'pastrami', 'honey ham', 'nova lox'],
                    'ounces':[4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [28]:
meat_to_animal={
    'bacon':'pig',
    'pulled pork':'pig',
    'pastrami':'cow',
    'corned beef':'cow',
    'honey ham':'pig',
    'nova lox':'salmon'
}

In [29]:
lowercased=data['food'].str.lower()

In [30]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [31]:
data['animal']=lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [32]:
data['food'].map(lambda x:meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values

In [33]:
data=pd.Series([1., -999, 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [34]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [35]:
#To use a different replacement for each value, pass a list of subtitutes
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [36]:
data.replace({-999:np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Indexes

In [37]:
data=pd.DataFrame(np.arange(12).reshape((3,4)), index=['Ohio', 'Colorado', 'New York'], columns=['one', 'two', 'three', 'four'])

In [38]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [39]:
transform=lambda x:x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [40]:
data.index=data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [41]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [42]:
data.rename(index={'OHIO':'INDIANA'}, columns={'three':'peekabo'})

         one  two  peekabo  four
INDIANA    0    1        2     3
COLO       4    5        6     7
NEW        8    9       10    11

### Discretization and Bining

In [43]:
ages=[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
#Lets divide these into bins of 18 to 25, 26 to 35, 36 to 60, and finally 61 and older
bins=[18, 25, 35, 60, 100]

In [44]:
cats=pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [45]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [46]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [47]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64